---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SiteFailures.BuildingPadNotConnected
source: html/3e290a46-d42a-be59-f645-9dcc499fecc3.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SiteFailures.BuildingPadNotConnected Property

Can't create a single Pad with several connected regions.

## Syntax (C#)
```csharp
public static FailureDefinitionId BuildingPadNotConnected { get; }
```